pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/******************************************************************************
Function Name   : usb_creg_set_cnen
Description     : Enable single end receiver.
Arguments       : USB_UTR_t *ptr : USB system internal structure. Selects channel.
Return value    : -
******************************************************************************/
void    usb_creg_set_cnen( USB_UTR_t *ptr )
{
    ptr->ipp1->SYSCFG.WORD |= USB_CNEN;
} /* eof usb_creg_set_xcke */

/******************************************************************************
Function Name   : usb_creg_clr_cnen
Description     : Disable single end receiver.
Arguments       : USB_UTR_t *ptr : USB system internal structure. Selects channel.
Return value    : -
******************************************************************************/
void    usb_creg_clr_cnen( USB_UTR_t *ptr )
{
    ptr->ipp1->SYSCFG.WORD &= ~USB_CNEN;
} /* eof usb_creg_clr_scke() */

/******************************************************************************
Function Name   : usb_creg_set_hse
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : USB_UTR_t *ptr  : Not used.
                : uint16_t  port  : Not used.
Return value    : none
******************************************************************************/
void    usb_creg_set_hse( USB_UTR_t *ptr, uint16_t port )
{
    if ( ptr->ip == USB_USBIP_1 )
    {
        ptr->ipp1->SYSCFG.WORD |= USB_HSE;
    }
} /* eof usb_creg_set_hse() */

/******************************************************************************
Function Name   : usb_creg_clr_hse
Description     : Clears HSE bit of the specified port's SYSCFG register
Arguments       : USB_UTR_t *ptr : USB system internal structure. Selects channel.
                : uint16_t  port : Port number
Return value    : none
******************************************************************************/
void    usb_creg_clr_hse( USB_UTR_t *ptr, uint16_t port )
{
    if ( ptr->ip == USB_USBIP_1 )
    {
        ptr->ipp->SYSCFG.WORD &= ~USB_HSE;
    }
} /* eof usb_creg_clr_hse() */

/******************************************************************************
Function Name   : usb_creg_set_dcfm
Description     : DCFM-bit set of register SYSCFG
                : (USB Host mode is selected.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_set_dcfm( USB_UTR_t *ptr )
{
    ptr->ipp->SYSCFG.WORD |= USB_DCFM;
} /* eof usb_creg_set_dcfm() */

/******************************************************************************
Function Name   : usb_creg_clr_dcfm
Description     : DCFM-bit clear of register SYSCFG.
                : (USB Peripheral mode is selected.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_dcfm( USB_UTR_t *ptr )
{
    ptr->ipp->SYSCFG.WORD &= ~USB_DCFM;
} /* eof usb_creg_clr_dcfm() */

/******************************************************************************
Function Name   : usb_creg_set_drpd
Description     : Set bit of the specified port's SYSCFG DRPD register.
                : (for USB Host mode; set D + / D-line PullDown.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
Return value    : none
******************************************************************************/
void    usb_creg_set_drpd( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->SYSCFG.WORD |= USB_DRPD;
    }
} /* eof usb_creg_set_drpd() */

/******************************************************************************
Function Name   : usb_creg_clr_drpd
Description     : Clear bit of the specified port's SYSCFG DRPD register.
                : (for USB Host mode; Enable D + / D-line PullDown.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : Port number
Return value    : none
******************************************************************************/
void    usb_creg_clr_drpd( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->SYSCFG.WORD &= ~USB_DRPD;
    }
} /* eof usb_creg_clr_drpd() */

/******************************************************************************
Function Name   : usb_creg_set_usbe
Description     : Enable USB operation.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_set_usbe( USB_UTR_t *ptr )
{
    ptr->ipp->SYSCFG.WORD |= USB_USBE;
} /* eof usb_creg_set_usbe() */

/******************************************************************************
Function Name   : usb_creg_clr_usbe
Description     : Enable USB operation.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_usbe( USB_UTR_t *ptr )
{
    ptr->ipp->SYSCFG.WORD &= ~USB_USBE;
} /* eof usb_creg_clr_usbe() */


/***********/
/*  BUSWAIT */
/***********/
/*  CPU Bus Wait Register */

/******************************************************************************
Function Name   : usb_creg_set_bus_wait
Description     : Set BUSWAIT register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_set_bus_wait( USB_UTR_t *ptr )
{
    ptr -> ipp1 -> BUSWAIT.WORD = USB_BWAIT_7; // 67ns / (1 / 120MHz) = 8.04 -> 9 cycle -> 7 wait 
} /* eof usb_creg_set_bus_wait() */


