pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/***********/
/*  SYSSTS0 */
/***********/
/* System Configuration Status Register 0 */

/******************************************************************************
Function Name   : usb_creg_read_syssts
Description     : Returns the value of the specified port's SYSSTS register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number. ($REA not used.)
Return value    : SYSSTS0 content
******************************************************************************/
uint16_t    usb_creg_read_syssts( USB_UTR_t *ptr, uint16_t port )
{
    return (uint16_t)(ptr->ipp->SYSSTS0.WORD);
} /* eof usb_creg_read_syssts() */

/******************************************************************************
Function Name   : usb_creg_write_syssts
Description     : Write to the specified port's SYSSTS register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
                : uint16_t  data  : The value to write
Return value    : none
******************************************************************************/
void        usb_creg_write_syssts( USB_UTR_t *ptr, uint16_t port, uint16_t data )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->SYSSTS0.WORD = data;
    }
} /* eof usb_creg_write_syssts() */

/************/
/*  DVSTCTR0  */
/************/
/* Device State Control Register 0 */

/******************************************************************************
Function Name   : usb_creg_read_dvstctr
Description     : Returns the specified port's DVSTCTR register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number. ($REA not used.)
Return value    : DVSTCTR0 content
******************************************************************************/
uint16_t    usb_creg_read_dvstctr( USB_UTR_t *ptr, uint16_t port )
{
    return (uint16_t)(ptr->ipp->DVSTCTR0.WORD);
} /* eof usb_creg_read_dvstctr() */

/******************************************************************************
Function Name   : usb_creg_write_dvstctr
Description     : Write data to the specified port's DVSTCTR register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : USB port number.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void        usb_creg_write_dvstctr( USB_UTR_t *ptr, uint16_t port, uint16_t data )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD = data;
    }
} /* eof usb_creg_write_dvstctr() */

/******************************************************************************
Function Name   : usb_creg_rmw_dvstctr
Description     : Read-modify-write the specified port's DVSTCTR.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : Port number
                : uint16_t  data  : The value to write.
                : uint16_t  bitptn: Bit pattern to read-modify-write.
Return value    : none
******************************************************************************/
void        usb_creg_rmw_dvstctr( USB_UTR_t *ptr, uint16_t port, uint16_t data, uint16_t bitptn )
{
    uint16_t    buf;

    if( USB_PORT0 == port )
    {
        buf = ptr->ipp->DVSTCTR0.WORD;
        buf &= ~bitptn;
        buf |= (data & bitptn);
        ptr->ipp->DVSTCTR0.WORD = buf;
    }
} /* eof usb_creg_rmw_dvstctr() */

/******************************************************************************
Function Name   : usb_creg_clr_dvstctr
Description     : Clear the bit pattern specified in argument, of the specified 
                : port's DVSTCTR register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : Port number
                : uint16_t  bitptn: Bit pattern to read-modify-write.
Return value    : none
******************************************************************************/
void        usb_creg_clr_dvstctr( USB_UTR_t *ptr, uint16_t port,uint16_t bitptn)
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD &= ~bitptn;
    }
} /* eof usb_creg_clr_dvstctr() */

/******************************************************************************
Function Name   : usb_creg_set_vbout
Description     : Set specified port's VBOUT-bit in the DVSTCTR register.
                : (To output a "High" to pin VBOUT.) 
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : Port number
Return value    : none
******************************************************************************/
void    usb_creg_set_vbout( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD |= USB_VBUSEN;
    }
} /* eof usb_creg_set_vbout() */

/******************************************************************************
Function Name   : usb_creg_clr_vbout
Description     : Clear specified port's VBOUT-bit in the DVSTCTR register.
                : (To output a "Low" to pin VBOUT.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  port  : Port number
Return value    : none
******************************************************************************/
void    usb_creg_clr_vbout( USB_UTR_t *ptr, uint16_t port )
{
    if( USB_PORT0 == port )
    {
        ptr->ipp->DVSTCTR0.WORD &= ~USB_VBUSEN;
    }
} /* eof usb_creg_clr_vbout() */


#if (USB1_IPTYPE_PP == USB_HS_PP)
/******************************************************************************
Function Name   : usb_creg_set_utst
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : USB_UTR_t *ptr  : 
                : uint16_t  data
Return value    : none
******************************************************************************/
void    usb_creg_set_utst( USB_UTR_t *ptr, uint16_t data )
{
#if defined(BSP_MCU_RX71M)
    ptr->ipp1->TESTMODE.WORD = data;
#endif /* defined(BSP_MCU_RX71M) */
} /* eof usb_creg_set_utst() */

#endif /* (USB1_IPTYPE_PP == USB_HS_PP) */


