pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/************/
/*  PINCFG  */
/************/

/******************************************************************************
Function Name   : usb_creg_set_ldrv
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : USB_UTR_t *ptr  : 
Return value    : none
******************************************************************************/
void    usb_creg_set_ldrv( USB_UTR_t *ptr )
{
} /* eof usb_creg_set_ldrv() */

/******************************************************************************
Function Name   : usb_creg_clr_ldrv
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : USB_UTR_t *ptr    : USB system internal data.
Return value    : none
******************************************************************************/
void    usb_creg_clr_ldrv( USB_UTR_t *ptr )
{
} /* eof usb_creg_clr_ldrv() */

/*********************************/
/*  DMA0CFG, DMA1CFG  for 597ASSP */
/*********************************/

/******************************************************************************
Function Name   : usb_creg_write_dmacfg
Description     : Not processed as the functionality is provided by R8A66597(ASSP).
Arguments       : USB_UTR_t *ptr    : USB system internal data.
Return value    : none
******************************************************************************/
void    usb_creg_write_dmacfg( USB_UTR_t *ptr, uint16_t pipemode, uint16_t data )
{
} /* eof usb_creg_write_dmacfg() */

/***************************/
/*  CFIFO, D0FIFO, D1FIFO  */
/***************************/
/* FIFO Port Register */

/******************************************************************************
Function Name   : usb_creg_read_fifo32
Description     : Data is read from the specified pipemode's FIFO register, 32-bits 
                : wide, corresponding to the specified PIPEMODE.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
Return value    : CFIFO/D0FIFO/D1FIFO content (32-bit)
******************************************************************************/
uint32_t    usb_creg_read_fifo32( USB_UTR_t *ptr, uint16_t pipemode )
{
    uint32_t    data;
    switch( pipemode )
    {
        case    USB_CUSE:
            data = ptr->ipp1->CFIFO.LONG;
            break;
        case    USB_D0USE:
#ifdef USB_DTC_ENABLE
        case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
            data = ptr->ipp1->D0FIFO.LONG;
            break;
        case    USB_D1USE:
#ifdef USB_DTC_ENABLE
        case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
            data = ptr->ipp1->D1FIFO.LONG;
            break;
        default:
            USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE2 );
            break;
    }
    return data;
} /* eof usb_creg_read_fifo32() */

/******************************************************************************
Function Name   : usb_creg_write_fifo32
Description     : Data is written to the specified pipemode's FIFO register, 32-bits 
                : wide, corresponding to the specified PIPEMODE.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
                : uint32_t  data      : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_fifo32( USB_UTR_t *ptr, uint16_t pipemode, uint32_t data )
{
    switch( pipemode )
    {
        case    USB_CUSE:
            ptr->ipp1->CFIFO.LONG = data;
            break;
        case    USB_D0USE:
#ifdef USB_DTC_ENABLE
        case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
            ptr->ipp1->D0FIFO.LONG = data;
            break;
        case    USB_D1USE:
#ifdef USB_DTC_ENABLE
        case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
            ptr->ipp1->D1FIFO.LONG = data;
            break;
        default:
            USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE3 );
            break;
    }
} /* eof usb_creg_write_fifo32() */

/******************************************************************************
Function Name   : usb_creg_read_fifo16
Description     : Data is read from the specified pipemode's FIFO register, 16-bits 
                : wide, corresponding to the specified PIPEMODE.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
Return value    : CFIFO/D0FIFO/D1FIFO content (16-bit)
******************************************************************************/
uint16_t    usb_creg_read_fifo16( USB_UTR_t *ptr, uint16_t pipemode )
{
    uint16_t    data;
    if (ptr -> ip  == USB_USBIP_0 )
    {
        switch( pipemode )
        {
            case    USB_CUSE:
                data = ptr->ipp->CFIFO.WORD;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                data = ptr->ipp->D0FIFO.WORD;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                data = ptr->ipp->D1FIFO.WORD;
                break;
            default:
                USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE4 );
                break;
        }
    }
    else if ( ptr->ip  == USB_USBIP_1 )
    {
        switch( pipemode )
        {
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
            case    USB_CUSE:
                data = ptr->ipp1->CFIFO.WORD.H;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                data = ptr->ipp1->D0FIFO.WORD.H;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                data = ptr->ipp1->D1FIFO.WORD.H;
                break;
#else /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            case    USB_CUSE:
                data = ptr->ipp1->CFIFO.WORD.L;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                data = ptr->ipp1->D0FIFO.WORD.L;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                data = ptr->ipp1->D1FIFO.WORD.L;
                break;
#endif /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            default:
                USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE5 );
                break;
        }
    }
    return data;
} /* eof usb_creg_read_fifo16() */

