pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/******************************************************************************
Function Name   : usb_creg_write_fifo16
Description     : Data is written to the specified pipemode's FIFO register, 16-bits 
                : wide, corresponding to the specified PIPEMODE.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipemode  : CUSE/D0DMA/D1DMA
                : uint16_t  data      : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_fifo16( USB_UTR_t *ptr, uint16_t pipemode, uint16_t data )
{
    if ( ptr->ip == USB_USBIP_0 )
    {
        switch( pipemode )
        {
            case    USB_CUSE:
                ptr->ipp->CFIFO.WORD = data;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp->D0FIFO.WORD = data;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp->D1FIFO.WORD = data;
                break;
            default:
                USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE6 );
                break;
        }
    }
    else if ( ptr->ip  == USB_USBIP_1 )
    {
        switch( pipemode )
        {
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
            case    USB_CUSE:
                ptr->ipp1->CFIFO.WORD.H = data;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp1->D0FIFO.WORD.H = data;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp1->D1FIFO.WORD.H = data;
                break;
#else /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            case    USB_CUSE:
                ptr->ipp1->CFIFO.WORD.L = data;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp1->D0FIFO.WORD.L = data;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp1->D1FIFO.WORD.L = data;
                break;
#endif /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            default:
                USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE7 );
                break;
        }
    }
} /* eof usb_creg_write_fifo16() */

/******************************************************************************
Function Name   : usb_creg_read_fifo8
Description     : Data is read from the specified pipemode's FIFO register, 8-bits 
                : wide, corresponding to the specified PIPEMODE.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipemode : CUSE/D0DMA/D1DMA.
Return value    : CFIFO/D0FIFO/D1FIFO(8-bit)
******************************************************************************/
uint8_t     usb_creg_read_fifo8( USB_UTR_t *ptr, uint16_t pipemode )
{
    uint8_t buf;
    if ( ptr->ip == USB_USBIP_0 )
    {
        switch( pipemode )
        {
            case    USB_CUSE:
                buf = ptr->ipp->CFIFO.BYTE.L;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                buf = ptr->ipp->D0FIFO.BYTE.L;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                buf = ptr->ipp->D1FIFO.BYTE.L;
                break;
            default:
                USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE8 );
                break;
        }
    }
    else if ( ptr->ip == USB_USBIP_1 )
    {
        switch( pipemode )
        {
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
            case    USB_CUSE:
                buf = ptr->ipp1->CFIFO.BYTE.HH;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                buf = ptr->ipp1->D0FIFO.BYTE.HH;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                buf = ptr->ipp1->D1FIFO.BYTE.HH;
                break;
#else /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            case    USB_CUSE:
                buf = ptr->ipp1->CFIFO.BYTE.LL;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                buf = ptr->ipp1->D0FIFO.BYTE.LL;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                buf = ptr->ipp1->D1FIFO.BYTE.LL;
                break;
#endif /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            default:
                USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE9 );
                break;
        }
    }
    return  buf;
} /* eof usb_creg_read_fifo8() */

/******************************************************************************
Function Name   : usb_creg_write_fifo8
Description     : Data is written to the specified pipemode's FIFO register, 8-bits 
                : wide, corresponding to the specified PIPEMODE.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipdemode   : CUSE/D0DMA/D1DMA
                : uint8_t   data        : The value to write.
Return value    : none
******************************************************************************/
void        usb_creg_write_fifo8( USB_UTR_t *ptr, uint16_t pipemode, uint8_t data )
{
    if ( ptr->ip == USB_USBIP_0 )
    {
        switch( pipemode )
        {
            case    USB_CUSE:
                ptr->ipp->CFIFO.BYTE.L = data;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp->D0FIFO.BYTE.L = data;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp->D1FIFO.BYTE.L = data;
                break;
            default:
                USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE10 );
                break;
        }
    }
    else if ( ptr->ip == USB_USBIP_1 )
    {
        switch( pipemode )
        {
#if USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP
            case    USB_CUSE:
                ptr->ipp1->CFIFO.BYTE.HH = data;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp1->D0FIFO.BYTE.HH = data;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp1->D1FIFO.BYTE.HH = data;
                break;
#else /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            case    USB_CUSE:
                ptr->ipp1->CFIFO.BYTE.LL = data;
                break;
            case    USB_D0USE:
#ifdef USB_DTC_ENABLE
            case    USB_D0DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp1->D0FIFO.BYTE.LL = data;
                break;
            case    USB_D1USE:
#ifdef USB_DTC_ENABLE
            case    USB_D1DMA:
#endif    /* USB_DTC_ENABLE */
                ptr->ipp1->D1FIFO.BYTE.LL = data;
                break;
#endif /* USB_CPUBYTE_PP == USB_BYTE_LITTLE_PP */
            default:
                USB_DEBUG_HOOK( USB_DEBUG_HOOK_STD | USB_DEBUG_HOOK_CODE11 );
                break;
        }
    }
} /* eof usb_creg_write_fifo8() */

/**********************************/
/* CFIFOSEL, D0FIFOSEL, D1FIFOSEL */
/**********************************/
/* FIFO Port Select Register */

