pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
    *reg_p = USB_BCLR;
} /* eof usb_creg_set_bclr() */


/*************/
/*  INTENB0  */
/*************/
/* Interrupt Enable Register 0 */

/******************************************************************************
Function Name   : usb_creg_read_intenb
Description     : Returns INTENB0 register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : INTENB0 content
******************************************************************************/
uint16_t    usb_creg_read_intenb( USB_UTR_t *ptr )
{
    return ptr->ipp->INTENB0.WORD;
} /* eof usb_creg_read_intenb() */

/******************************************************************************
Function Name   : usb_creg_write_intenb
Description     : Data is written to INTENB register, 
                : enabling/disabling the various USB interrupts.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_intenb( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->INTENB0.WORD = data;
} /* eof usb_creg_write_intenb() */

/******************************************************************************
Function Name   : usb_creg_set_intenb
Description     : Bit(s) to be set in INTENB register, 
                : enabling the respective USB interrupt(s).
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : Bit pattern: Respective interrupts with '1' 
                                  : will be enabled.
Return value    : none
******************************************************************************/
void    usb_creg_set_intenb( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->INTENB0.WORD |= data;
} /* eof usb_creg_set_intenb() */

/******************************************************************************
Function Name   : usb_creg_clr_enb_vbse
Description     : Clear the VBE-bit of INTENB register,
                : to prohibit VBUS interrupts.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_enb_vbse( USB_UTR_t *ptr )
{
    ptr->ipp->INTENB0.WORD &= ~USB_VBSE;
} /* eof usb_creg_clr_enb_vbse() */

/******************************************************************************
Description     : Clear the SOFE-bit of INTENB register,
                : to prohibit Frame Number Update interrupts.
Function Name   : usb_creg_clr_enb_sofe
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_enb_sofe( USB_UTR_t *ptr )
{
    ptr->ipp->INTENB0.WORD &= ~USB_SOFE;
} /* eof usb_creg_clr_enb_sofe() */


/*************/
/*  INTENB1  */
/*************/

/*************/
/*  BRDYENB  */
/*************/
/* BRDY Interrupt Enable Register */

/******************************************************************************
Function Name   : usb_creg_read_brdyenb
Description     : Returns BRDYENB register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : BRDYENB content
******************************************************************************/
uint16_t    usb_creg_read_brdyenb( USB_UTR_t *ptr )
{
    return ptr->ipp->BRDYENB.WORD;
} /* eof usb_creg_read_brdyenb() */

/******************************************************************************
Function Name   : usb_creg_write_brdyenb
Description     : Data is written to BRDYENB register, 
                : enabling/disabling each respective pipe's BRDY interrupt. 
                : (The BRDY interrupt indicates that a FIFO port is accessible.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data        : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_brdyenb( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->BRDYENB.WORD = data;
} /* eof usb_creg_write_brdyenb() */

/******************************************************************************
Function Name   : usb_creg_set_brdyenb
Description     : A bit is set in the specified pipe's BRDYENB, enabling the 
                : respective pipe BRDY interrupt(s).
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_set_brdyenb( USB_UTR_t *ptr, uint16_t  pipeno )
{
    ptr->ipp->BRDYENB.WORD |= (1 << pipeno);
} /* eof usb_creg_set_brdyenb() */

/******************************************************************************
Function Name   : usb_creg_clr_brdyenb
Description     : Clear the PIPExBRDYE-bit of the specified pipe to prohibit 
                : BRDY interrupts of that pipe.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_clr_brdyenb( USB_UTR_t *ptr, uint16_t  pipeno )
{
    ptr->ipp->BRDYENB.WORD &= ~(1 << pipeno);
} /* eof usb_creg_clr_brdyenb() */


/*************/
/*  NRDYENB  */
/*************/
/* NRDY (not ready) Interrupt Enable Register */

/******************************************************************************
Function Name   : usb_creg_read_nrdyenb
Description     : Returns NRDYENB register content. 
                : (The NRDY interrupt indicates that more time is needed before 
                : continuing data communication.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : NRDYENB content
******************************************************************************/
uint16_t    usb_creg_read_nrdyenb( USB_UTR_t *ptr )
{
    return ptr->ipp->NRDYENB.WORD;
} /* eof usb_creg_read_nrdyenb() */

