pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/******************************************************************************
Function Name   : usb_creg_write_nrdyenb
Description     : Data is written to NRDYENB register, 
                : enabling/disabling each respective pipe's NRDY interrupt
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_nrdyenb( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->NRDYENB.WORD = data;
} /* eof usb_creg_write_nrdyenb() */

/******************************************************************************
Function Name   : usb_creg_set_nrdyenb
Description     : A bit is set in the specified pipe's NRDYENB, enabling the 
                : respective pipe NRDY interrupt(s).
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_set_nrdyenb( USB_UTR_t *ptr, uint16_t pipeno )
{
    ptr->ipp->NRDYENB.WORD |= (1 << pipeno);
} /* eof usb_creg_set_nrdyenb() */

/******************************************************************************
Function Name   : usb_creg_clr_nrdyenb
Description     : Clear the PIPExNRDYE-bit of the specified pipe to prohibit 
                : NRDY interrupts of that pipe.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_clr_nrdyenb(USB_UTR_t *ptr, uint16_t pipeno )
{
    ptr->ipp->NRDYENB.WORD &= ~(1 << pipeno);
} /* eof usb_creg_clr_nrdyenb() */


/*************/
/*  BEMPENB  */
/*************/
/* BEMP (buffer empty) Interrupt Enable Register */

/******************************************************************************
Function Name   : usb_creg_read_bempenb
Description     : Returns BEMPENB register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : BEMPENB content
******************************************************************************/
uint16_t    usb_creg_read_bempenb( USB_UTR_t *ptr )
{
    return ptr->ipp->BEMPENB.WORD;
} /* eof usb_creg_read_bempenb() */

/******************************************************************************
Function Name   : usb_creg_write_bempenb
Description     : Data is written to BEMPENB register, 
                : enabling/disabling each respective pipe's BEMP interrupt. 
                : (The BEMP interrupt indicates that the USB buffer is empty, 
                : and so the FIFO can now be written to.)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_bempenb( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->BEMPENB.WORD = data;
} /* eof usb_creg_write_bempenb() */

/******************************************************************************
Function Name   : usb_creg_set_bempenb
Description     : A bit is set in the specified pipe's BEMPENB enabling the 
                : respective pipe's BEMP interrupt(s).
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_set_bempenb( USB_UTR_t *ptr, uint16_t pipeno )
{
    ptr->ipp->BEMPENB.WORD |= (1 << pipeno);
} /* eof usb_creg_set_bempenb() */

/******************************************************************************
Function Name   : usb_creg_clr_bempenb
Description     : Clear the PIPExBEMPE-bit of the specified pipe to prohibit 
                : BEMP interrupts of that pipe.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_clr_bempenb( USB_UTR_t *ptr, uint16_t pipeno )
{
    ptr->ipp->BEMPENB.WORD &= ~(1 << pipeno);
} /* eof usb_creg_clr_bempenb() */


/*************/
/*  SOFCFG   */
/*************/
/* SOF (start of frame) Output Configuration Register */

/******************************************************************************
Function Name   : usb_creg_read_sofcfg
Description     : Returns SOFCFG register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : SOFCFG content
******************************************************************************/
uint16_t    usb_creg_read_sofcfg( USB_UTR_t *ptr )
{
    return ptr->ipp->SOFCFG.WORD;
} /* eof usb_creg_read_sofcfg() */


/******************************************************************************
Function Name   : usb_creg_set_sofcfg
Description     : Set Bit pattern for SOFCFG
                : 
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to OR.
Return value    : none
******************************************************************************/
void    usb_creg_set_sofcfg( USB_UTR_t *ptr, uint16_t data )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->SOFCFG.WORD |= data;
    }
} /* eof usb_creg_set_sofcfg() */



/*************/
/*  PHYSET   */
/*************/
/* PHY Setting Register */

/******************************************************************************
Function Name   : usb_creg_write_clksel
Description     : Set CLKSEL bits.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_write_clksel( USB_UTR_t *ptr )
{
    ptr->ipp1->PHYSET.WORD |= USB_CLKSEL_24;
} /* eof usb_creg_write_clksel() */

