pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/******************************************************************************
Function Name   : usb_creg_clr_pllreset
Description     : Clear PLLRESET bits.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_pllreset( USB_UTR_t *ptr )
{
    ptr->ipp1->PHYSET.WORD &= ~USB_PLLRESET;
} /* eof usb_creg_clr_pllreset() */

/******************************************************************************
Function Name   : usb_creg_clr_dirpd
Description     : Clear DIRPD bits.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_dirpd( USB_UTR_t *ptr )
{
    ptr->ipp1->PHYSET.WORD &= ~USB_DIRPD;
} /* eof usb_creg_clr_dirpd() */

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
/******************************************************************************
Function Name   : usb_creg_clr_hseb
Description     : Clear HSEB bits.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_hseb( USB_UTR_t *ptr )
{
    ptr->ipp1->PHYSET.WORD &= ~USB_HSEB;
} /* eof usb_creg_clr_hseb() */
/******************************************************************************
Function Name   : usb_creg_write_repsel
Description     : Set REPSEL bits.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_write_repsel( USB_UTR_t *ptr )
{
    ptr->ipp1->PHYSET.WORD &= ~USB_REPSEL;
    ptr->ipp1->PHYSET.WORD |= USB_REPSEL_16;
} /* eof usb_creg_write_repsel() */
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

/*************/
/*  INTSTS0  */
/*************/
/* Interrupt Status Register 0 */

/******************************************************************************
Function Name   : usb_creg_read_intsts
Description     : Returns INTSTS0 register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : INTSTS0 content
******************************************************************************/
uint16_t    usb_creg_read_intsts( USB_UTR_t *ptr )
{
    return ptr->ipp->INTSTS0.WORD;
} /* eof usb_creg_read_intsts() */

/******************************************************************************
Function Name   : usb_creg_write_intsts
Description     : Data is written to INTSTS0 register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_intsts( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->INTSTS0.WORD = data;
} /* eof usb_creg_write_intsts() */

/******************************************************************************
Function Name   : usb_creg_clr_sts_vbint
Description     : Clear the the VBINT status bit to clear its the VBUS inter-
                : rupt status.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_sts_vbint( USB_UTR_t *ptr )
{
    ptr->ipp->INTSTS0.WORD = (uint16_t)~USB_VBINT;
} /* eof usb_creg_clr_sts_vbint() */

/******************************************************************************
Function Name   : usb_creg_clr_sts_sofr
Description     : Clear the SOFR-bit (Frame Number Refresh Interrupt Status) of 
                : the clear SOF interrupt status.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_sts_sofr( USB_UTR_t *ptr )
{
    ptr->ipp->INTSTS0.WORD = (uint16_t)~USB_SOFR;
} /* eof usb_creg_clr_sts_sofr() */


/*************/
/*  INTSTS1  */
/*************/
/* Interrupt Status Register 1 */


/************/
/* BRDYSTS  */
/************/
/* BRDY (buffer ready) Interrupt Status Register */

/******************************************************************************
Function Name   : usb_creg_read_brdysts
Description     : Returns BRDYSTS register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : BRDYSTS content
******************************************************************************/
uint16_t    usb_creg_read_brdysts( USB_UTR_t *ptr )
{
    return ptr->ipp->BRDYSTS.WORD;
} /* eof usb_creg_read_brdysts() */

/******************************************************************************
Function Name   : usb_creg_write_brdysts
Description     : Data is written to BRDYSTS register, to set the BRDY interrupt status.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void        usb_creg_write_brdysts( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->BRDYSTS.WORD = data;
} /* eof usb_creg_write_brdysts() */

/******************************************************************************
Function Name   : usb_creg_clr_sts_brdy
Description     : Clear the PIPExBRDY status bit of the specified pipe to clear 
                : its BRDY interrupt status.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_clr_sts_brdy( USB_UTR_t *ptr, uint16_t pipeno )
{
    ptr->ipp->BRDYSTS.WORD = (uint16_t)~(1 << pipeno);
} /* eof usb_creg_clr_sts_brdy() */


