pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/************/
/* NRDYSTS  */
/************/
/* NRDY (not ready) Interrupt Status Register */
/******************************************************************************
Function Name   : usb_creg_read_brdysts
Description     : Returns NRDYSTS register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : NRDYSTS content
******************************************************************************/
uint16_t    usb_creg_read_nrdysts( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->NRDYSTS.WORD;
} /* eof usb_creg_read_brdysts() */

/******************************************************************************
Function Name   : usb_creg_write_nrdysts
Description     : Data is written to NRDYSTS register, to
                : set the NRDY interrupt status.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void        usb_creg_write_nrdysts( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->NRDYSTS.WORD = data;
} /* eof usb_creg_write_nrdysts() */

/******************************************************************************
Function Name   : usb_creg_clr_sts_nrdy
Description     : Clear the PIPExNRDY status bit of the specified pipe to clear 
                : its NRDY interrupt status.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_clr_sts_nrdy( USB_UTR_t *ptr, uint16_t pipeno )
{
    ptr->ipp->NRDYSTS.WORD = (uint16_t)~(1 << pipeno);
} /* eof usb_creg_clr_sts_nrdy() */


/************/
/* BEMPSTS  */
/************/
/* BEMP Interrupt Status Register */

/******************************************************************************
Function Name   : usb_creg_read_bempsts
Description     : Returns BEMPSTS register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : BEMPSTS content
******************************************************************************/
uint16_t    usb_creg_read_bempsts( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->BEMPSTS.WORD;
} /* eof usb_creg_read_bempsts() */

/******************************************************************************
Function Name   : usb_creg_write_bempsts
Description     : Data is written to BEMPSTS register, to set the BEMP interrupt status.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data        : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_bempsts( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->BEMPSTS.WORD = data;
} /* eof usb_creg_write_bempsts() */

/******************************************************************************
Function Name   : usb_creg_clr_sts_bemp
Description     : Clear the PIPExBEMP status bit of the specified pipe to clear 
                : its BEMP interrupt status.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  pipeno: Pipe number.
Return value    : none
******************************************************************************/
void    usb_creg_clr_sts_bemp( USB_UTR_t *ptr, uint16_t pipeno )
{
    ptr->ipp->BEMPSTS.WORD = (uint16_t)~(1 << pipeno);
} /* eof usb_creg_clr_sts_bemp() */


/************/
/* FRMNUM   */
/************/
/* Frame Number Register */

/******************************************************************************
Function Name   : usb_creg_read_frmnum
Description     : Returns FRMNUM register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : FRMNUM content
******************************************************************************/
uint16_t    usb_creg_read_frmnum( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->FRMNUM.WORD;
} /* eof usb_creg_read_frmnum() */


/************/
/* USBADDR  */
/************/
/* USB Address Register */

/******************************************************************************
Function Name   : usb_creg_read_usbaddr
Description     : Returns USBADDR register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : USBADDR content
******************************************************************************/
uint16_t    usb_creg_read_usbaddr( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->USBADDR.WORD;
} /* eof usb_creg_read_usbaddr() */

/******************************************************************************
Function Name   : usb_creg_set_stsrecov
Description     : STSRECOV-bits are set in USBADDR register
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : Value to be set.
Return value    : none
******************************************************************************/
void    usb_creg_set_stsrecov( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->USBADDR.BIT.STSRECOV = data;
} /* eof usb_creg_set_stsrecov() */


/************/
/* USBREQ   */
/************/
/* USB Request Type Register (bRequest and bmRequestType) */

/******************************************************************************
Function Name   : usb_creg_read_usbreq
Description     : Returns USBREQ register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : USBREQ content
******************************************************************************/
uint16_t    usb_creg_read_usbreq( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->USBREQ.WORD;
} /* eof usb_creg_read_usbreq() */


/************/
/* USBVAL   */
/************/
/* USB Request Value Register (wValue) */

