pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/******************************************************************************
Function Name   : usb_creg_read_usbval
Description     : Returns USBVAL register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : USBVAL content
******************************************************************************/
uint16_t    usb_creg_read_usbval( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->USBVAL;
} /* eof usb_creg_read_usbval() */


/************/
/* USBINDX  */
/************/
/* USB Request Index Register (wIndex) */

/******************************************************************************
Function Name   : usb_creg_read_usbindx
Description     : Returns USBINDX register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : USBINDX content
******************************************************************************/
uint16_t    usb_creg_read_usbindx( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->USBINDX;
} /* eof usb_creg_read_usbindx() */


/************/
/* USBLENG  */
/************/
/* USB Request Length Register (wLength) */

/******************************************************************************
Function Name   : usb_creg_read_usbleng
Description     : Returns USBLENG register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : USBLENG content
******************************************************************************/
uint16_t    usb_creg_read_usbleng( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->USBLENG;
} /* eof usb_creg_read_usbleng() */


/************/
/* DCPCFG   */
/************/
/* DCP Configuration Register */

/******************************************************************************
Function Name   : usb_creg_read_dcpcfg
Description     : Returns DCPCFG register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : DCPCFG content
******************************************************************************/
uint16_t    usb_creg_read_dcpcfg( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->DCPCFG.WORD;
} /* eof usb_creg_read_dcpcfg() */

/******************************************************************************
Function Name   : usb_creg_write_dcpcfg
Description     : Specified data is written to DCPCFG register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data
Return value    : none
******************************************************************************/
void    usb_creg_write_dcpcfg( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->DCPCFG.WORD = data;
} /* eof usb_creg_write_dcpcfg()*/

/******************************************************************************
Function Name   : usb_creg_set_dcpshtnak
Description     : SHTNAK-bit in the DCPCFG register is set.
                : = Pipe disabled at end of transfer.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_set_dcpshtnak( USB_UTR_t *ptr )
{
    ptr->ipp->DCPCFG.WORD |= USB_SHTNAKON;
} /* eof usb_creg_set_dcpshtnak() */


/************/
/* DCPMAXP  */
/************/
/* DCP Maximum Packet Size Register */

/******************************************************************************
Function Name   : usb_creg_read_dcpmaxp
Description     : Returns DCPMAXP register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : DCPMAXP content
******************************************************************************/
uint16_t    usb_creg_read_dcpmaxp( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->DCPMAXP.WORD;
} /* eof usb_creg_read_dcpmaxp() */

/******************************************************************************
Function Name   : usb_creg_write_dcpmxps
Description     : Specified data is written to DCPMAXP register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_dcpmxps( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->DCPMAXP.WORD = data;
} /* eof usb_creg_write_dcpmxps() */


/************/
/* DCPCTR   */
/************/
/* DCP Control Register */

/******************************************************************************
Function Name   : usb_creg_read_dcpctr
Description     : Returns DCPCTR register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : DCPCTR content
******************************************************************************/
uint16_t    usb_creg_read_dcpctr( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->DCPCTR.WORD;
} /* eof usb_creg_read_dcpctr() */


/************/
/* PIPESEL  */
/************/
/* Pipe Window Select Register */
/******************************************************************************
Function Name   : usb_creg_read_pipesel
Description     : Returns PIPESEL register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : PIPESEL content
******************************************************************************/
uint16_t    usb_creg_read_pipesel( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->PIPESEL.WORD;
} /* eof usb_creg_read_pipesel() */

/******************************************************************************
Function Name   : usb_creg_write_pipesel
Description     : Specified data is written to PIPESEL register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_pipesel( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->PIPESEL.WORD = data;
} /* eof usb_creg_write_pipesel() */


