pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
/************/
/* PIPECFG  */
/************/
/* Pipe Configuration Register */

/******************************************************************************
Function Name   : usb_creg_read_pipecfg
Description     : Returns PIPECFG register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : PIPECFG content
******************************************************************************/
uint16_t    usb_creg_read_pipecfg( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->PIPECFG.WORD;
} /* eof usb_creg_read_pipecfg() */

/******************************************************************************
Function Name   : usb_creg_write_pipecfg
Description     : Specified data is written to PIPECFG register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_pipecfg( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->PIPECFG.WORD = data;
} /* eof usb_creg_write_pipecfg() */

/******************************************************************************
Function Name   : usb_creg_set_type
Description     : Specified Transfer Type is set in PIPECFG register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : BULK/INT/ISO
Return value    : none
******************************************************************************/
void    usb_creg_set_type( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->PIPECFG.WORD &= (uint16_t)~USB_TYPE;
    ptr->ipp->PIPECFG.WORD |= (data << USB_TYPE_NUM_SHIFT);
} /* eof usb_creg_set_type() */

/************/
/* PIPEBUF  */
/************/
/* - */

/******************************************************************************
Function Name   : usb_creg_write_pipebuf
Description     : Specified the value by 2nd argument is set to PIPEBUF register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_pipebuf( USB_UTR_t *ptr, uint16_t data )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->PIPEBUF.WORD = data;
    }
} /* eof usb_creg_write_pipebuf() */

/******************************************************************************
Function Name   : usb_creg_read_pipebuf
Description     : Returns PIPECFG register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : PIPEBUF content
******************************************************************************/
uint16_t    usb_creg_read_pipebuf( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        return  (uint16_t)ptr->ipp1->PIPEBUF.WORD;
    }
    else
    {
        return  0;
    }
} /* eof usb_creg_read_pipebuf() */

/************/
/* PIPEMAXP */
/************/
/* Pipe Maximum Packet Size Register */

/******************************************************************************
Function Name   : usb_creg_read_pipemaxp
Description     : Returns PIPEMAXP register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : PIPEMAXP content
******************************************************************************/
uint16_t    usb_creg_read_pipemaxp( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->PIPEMAXP.WORD;
} /* eof usb_creg_read_pipemaxp() */

/******************************************************************************
Function Name   : usb_creg_write_pipemaxp
Description     : Specified data is written to PIPEMAXP register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_pipemaxp( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->PIPEMAXP.WORD = data;
} /* eof usb_creg_write_pipemaxp() */

/******************************************************************************
Function Name   : usb_creg_set_mxps
Description     : The specified MXPS-bits, Maximum Packet Size, in PIPEMAXP register is set.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : Max packet size value.
Return value    : none
******************************************************************************/
void    usb_creg_set_mxps( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->PIPEMAXP.WORD &= (uint16_t)~USB_MXPS;
    ptr->ipp->PIPEMAXP.WORD |= (data << USB_MXPS_NUM_SHIFT);
} /* eof usb_creg_set_mxps() */


/************/
/* PIPEPERI */
/************/
/* Pipe Cycle Control Register */

/******************************************************************************
Function Name   : usb_creg_read_pipeperi
Description     : Returns PIPEPERI register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : PIPEPERI content
******************************************************************************/
uint16_t usb_creg_read_pipeperi( USB_UTR_t *ptr )
{
    return (uint16_t)ptr->ipp->PIPEPERI.WORD;
} /* eof usb_creg_read_pipeperi() */

/******************************************************************************
Function Name   : usb_creg_write_pipeperi
Description     : Specified data is written to PIPEPERI register.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
                : uint16_t  data  : The value to write.
Return value    : none
******************************************************************************/
void    usb_creg_write_pipeperi( USB_UTR_t *ptr, uint16_t data )
{
    ptr->ipp->PIPEPERI.WORD = data;
} /* eof usb_creg_write_pipeperi() */


/********************/
/* DCPCTR, PIPEnCTR */
/********************/
/* PIPEn Control Registers */

