pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/r_usb_creg_access.c
    reg_p = (uint16_t *)&(ptr->ipp->PIPE1TRN) + ((pipeno - 1) * 2);

    *reg_p = data;
} /* eof usb_creg_write_pipetrn */

/************/
/* DEVADDn  */
/************/


/************/
/* LPSTS    */
/************/
/******************************************************************************
Function Name   : usb_creg_set_suspendm
Description     : Set SuspendM bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_set_suspendm( USB_UTR_t *ptr )
{
    ptr->ipp1->LPSTS.WORD |= USB_SUSPENDM;
} /* eof usb_creg_set_suspendm */

/************/
/* BCCTRL   */
/************/
/******************************************************************************
Function Name   : usb_creg_read_bcctrl
Description     : Returns BCCTRL register content.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : BCCTRL content
******************************************************************************/
uint16_t    usb_creg_read_bcctrl( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        return  (uint16_t)ptr->ipp1->BCCTRL.WORD;
    }
    else
    {
        return  0;
    }
} /* eof usb_creg_read_bcctrl() */

/******************************************************************************
Function Name   : usb_creg_set_vdmsrce
Description     : Set VDMSRCE bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_set_vdmsrce( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->BCCTRL.WORD |= USB_VDMSRCE;
    }
} /* eof usb_creg_set_vdmsrce() */

/******************************************************************************
Function Name   : usb_creg_clr_vdmsrce
Description     : Clear VDMSRCE bits.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_vdmsrce( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->BCCTRL.WORD &= ~USB_VDMSRCE;
    }
} /* eof usb_creg_clr_vdmsrce() */

/******************************************************************************
Function Name   : usb_creg_set_idpsinke
Description     : Set IDPSINKE bit.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_set_idpsinke( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->BCCTRL.WORD |= USB_IDPSINKE;
    }
} /* eof usb_creg_set_idpsinke() */

/******************************************************************************
Function Name   : usb_creg_clr_idpsinke
Description     : Clear IDPSINKE bits.
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel.
Return value    : none
******************************************************************************/
void    usb_creg_clr_idpsinke( USB_UTR_t *ptr )
{
    if(ptr->ip == USB_USBIP_1)
    {
        ptr->ipp1->BCCTRL.WORD &= ~USB_IDPSINKE;
    }
} /* eof usb_creg_clr_idpsinke() */

/******************************************************************************
End of file
******************************************************************************/
